tests/results/bf16-dflash-ab-full48-20260712/target_only/throughput/concurrency-6.log
benchmark_args=Namespace(backend='sglang', base_url='http://127.0.0.1:33000', host='0.0.0.0', port=None, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='/workspace/models/opd-32b-deploy', served_model_name=None, tokenizer='/workspace/models/opd-32b-deploy', num_prompts=12, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=512, random_output_len=512, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=6, output_file='/workspace/aimo-proof-pilot-eval/tests/results/bf16-dflash-ab-full48-20260712/target_only/throughput/concurrency-6.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=20260711, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:33000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url='http://127.0.0.1:33000', host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='/workspace/models/opd-32b-deploy', served_model_name=None, tokenizer='/workspace/models/opd-32b-deploy', num_prompts=12, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=512, random_output_len=512, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=6, output_file='/workspace/aimo-proof-pilot-eval/tests/results/bf16-dflash-ab-full48-20260712/target_only/throughput/concurrency-6.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=20260711, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 6144
#Output tokens: 6144
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 6         
Successful requests:                     12        
Benchmark duration (s):                  23.96     
Total input tokens:                      6144      
Total input text tokens:                 6144      
Total generated tokens:                  6144      
Total generated tokens (retokenized):    6144      
Request throughput (req/s):              0.50      
Input token throughput (tok/s):          256.42    
Output token throughput (tok/s):         256.42    
Peak output token throughput (tok/s):    270.00    
Peak concurrent requests:                12        
Total token throughput (tok/s):          512.84    
Concurrency:                             5.99      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   11967.47  
Median E2E Latency (ms):                 11967.16  
P90 E2E Latency (ms):                    11971.07  
P95 E2E Latency (ms):                    11971.57  
P99 E2E Latency (ms):                    11972.04  
---------------Time to First Token----------------
Mean TTFT (ms):                          342.52    
Median TTFT (ms):                        364.65    
P90 TTFT (ms):                           443.91    
P95 TTFT (ms):                           453.53    
P99 TTFT (ms):                           454.40    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          22.75     
Median TPOT (ms):                        22.71     
P90 TPOT (ms):                           23.09     
P95 TPOT (ms):                           23.14     
P99 TPOT (ms):                           23.15     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           22.75     
Median ITL (ms):                         22.52     
P90 ITL (ms):                            22.57     
P95 ITL (ms):                            22.62     
P99 ITL (ms):                            28.31     
Max ITL (ms):                            42.23     
==================================================